app/controllers/customers_controller.rb

INSERT INTO "customers" ("created_at", "name", "price", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 14 Nov 2013 05:05:01 UTC +00:00], ["name", "shivam"], ["price", 1000], ["updated_at", Thu, 14 Nov 2013 05:05:01 UTC +00:00]]
---
  def create
    @customer=Customer.create(params[:customer])

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "customers" SET "price" = 56565, "updated_at" = '2013-11-14 05:26:29.653039' WHERE "customers"."id" = 1
---
  def update
    @customer=Customer.find(params[:id])
      if @customer.update_attributes(params[:customer])

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 1]]
---
  def destroy
    @customer=Customer.find(params[:id])
      if @customer.destroy