app/controllers/orders_controller.rb

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = 4
---
 def index
  @customer = Customer.find(params[:customer_id])
  @orders = @customer.orders

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "4"]]
---
 def new
  @customer = Customer.find(params[:customer_id])

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "4"]]
INSERT INTO "orders" ("cost", "created_at", "customer_id", "order_no", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cost", 565], ["created_at", Thu, 14 Nov 2013 07:05:40 UTC +00:00], ["customer_id", 4], ["order_no", "bacd234"], ["updated_at", Thu, 14 Nov 2013 07:05:40 UTC +00:00]]
---
 def create
  @customer = Customer.find(params[:customer_id])
  @order=@customer.orders.create(params[:order])

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = 4 AND "orders"."id" = ? LIMIT 1  [["id", "1"]]
---
 def edit
  @customer = Customer.find(params[:customer_id])
  @order= @customer.orders.find(params[:id])

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = 4 AND "orders"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "orders" SET "cost" = 565656, "updated_at" = '2013-11-14 07:53:18.481888' WHERE "orders"."id" = 2
---
 def update
   @customer = Customer.find(params[:customer_id])
   @order = @customer.orders.find(params[:id])
   if @order.update_attributes(params[:order])

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = 4 AND "orders"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 1]]
---
 def destroy
    @customer = Customer.find(params[:customer_id])
    @order = @customer.orders.find(params[:id])
     if @order.destroy